<?php
?>
<html>

<head>
<meta http-equiv=Content-Type content="text/html; charset=utf-8">
<link rel="stylesheet" href="style.css" type="text/css" />
</head>

<body>
<div class="div-menu">
<ul id="content" class="ul1">
    <li>Գործողություններ
        <ul class="ul2">
            <li>Նոր պահեստի մուտք</li>
            <li>Նոր պահեստի ելք</li>
            <li>Նոր պահեստի տեղաշարժ</li>
            <li>Նոր պահեստի կոմպլեկտավորում</li>
            <li>Նոր պահեստի ապակոմպլեկտավորում</li>
            <li>Նոր պահեստի գույքագրում</li>
        </ul>
	</li>
    <li>Հաշվետվություններ
		<ul class="ul2">
			<li>Փասթաթղթերի մատյան</li>
			<li>Պահեստի փասթաթղթեր</li>
			<li>Ապրանքներ պահեստում</li>
			<li>Տեղաշարժ պահեստում</li>
			<li>Տեղաշարժ պահեստում, ապակոմպլեկտավորված</li>
			<li>Ապակոմպլեկտավորված ապրանքներ պահեստում</li>
			<li>Ապրանքի ելք ըստ վաճառքի</li>
			<li>Վաճառք, ընդհանուր</li>
			<li>Վաճառք, ուտեստներ</li>
			<li>Վաճառք, տեսականի</li>
		</ul>
	</li>	
    <li>Դրամարկղ</li>
		<ul class="ul2">
			<li>Նոր դրամարկղի փասթաթուղթ</li>
			<li>Գործարքներ դրամարկղում</li>
			<li>Դրամի շարժ</li>
			<li>Պարտքի մարում</li>
			<li>Հաճախորդների պարտքեր</li>
			<li>Դրամարկղների ցանկ</li>
		</ul>
    <li>Աշխատավարձ</li>
		<ul class="ul2">
			<li>Նոր աշխատավարձի փասթաթուղթ</li>
			<li>Վճարումներ ըստ աշխատողների</li>
		</ul>
    <li>Ճաշացանկ</li>
		<ul class="ul2">
			<li>Ուտեստի բաժիններ</li>
			<li>Ուտեստի տեսակներ</li>
			<li>Ուտեստների ցանկ</li>
			<li>Ճաշացանկների ցանկ</li>
			<li>Ուտեստի հեռացման պատճառ</li>
			<li>Մեկնաբանություն ուտեստի համար</li>
			<li>Ճաշացանկի վերանայում</li>
		</ul>
    <li>Ապրանքներ</li>
    <li>Այլ</li>
    <li>Կարգավորումներ</li>
</ul>
<br>
</div>
<div class="div-history">
<p class="header">Գործողություններ</p>
<p class="history">Բոլոր գործողությունները պահեստում միանման են։ Պետք է նշել պահեստը, հավաքել ապրանքների ցանկը։ Ապրանքների ցանկը լրացնելու համար պետք է սեղմել <img class="textimg" src="img/add.png" /> կոճակը, և ցանկից ընտրել անհրաժեշտ ապրանքը։ Եթե ցանկի մեջ անհրաժեշտ ապրանքի անվանումը բացակայում է, ապա այդ ապրանքը պետք է ավելացնել ցանկում, սեղմելով <img class="textimg" src="img/new.png" /> կոճակը։ Ներքևում աղյուսակի մեջ տրվում է փասթաթուղթը լրացնելու ժամանակ անհրաժեշտ դաշտերի բացատրությունները։</p>
<p><table class="minimalistBlack">
<thead>
<th>Դաշտ</th><th>Նշանակություն</th>
</thead>
<tr><td>Ամսաթիվ</td><td>Փասթաթղթի գրանցման ամսաթիվ</td></tr>
<tr><td>Համար</td><td>Փասթաթղթի համարնէ, որը կարելի է նշել ձեռքով ինչպես նաև, եթե նշված չէ, նշանակում է ծրագիրը</td></tr>
<tr><td>ՀԱ մսաթիվ</td><td>Հաշիվ ապրանքագրի ամսաթիվը, որը կցած է տվյալ փասթաթղթին</td></tr>
<tr><td>ՀԱ համար</td><td>Հաշիվ ապրանքագրի համարը, որը կցած է տվյալ փասթաթղթին</td></tr>
<tr><td>Մուտքի պահեստ</td><td>Պահեստի կոդ, որտեղ մուտքագրվելու է ապրանքները։ Նշվում է պահեստի մուտքի, պահեստի տեղաշարժի և պահեստի կոմպլեկտավորմանժամանակ։</td></tr>
<tr><td>Ելքի պահեստ</td><td>Պահեստի կոդ, որտեղից դուրս է գրվելու ապրանքները։ Նշվում է պահեստի ելքի, պահեստի տեղաշարժի և պահեստի կոմպլեկտավորման ժամանակ։</td></tr>
<tr><td>Նշանակություն</td><td>Ձեռք բերման նշանակություն։</td></tr>
<tr><td>Մեկնաբանություն</td><td>Լրացուցիչ տեղեկություններ</td></tr>
<tr><td>Կոմպլեկտավորում</td><td>Կոմպլետավորման ժամանակ առաջացած նոր ապրանքի կոդ և քանակ</td></tr>
<tr><td><img class="textimg" src="img/add.png" /></td><td>Ավելացնել նոր տող գրանցված ապրանքների անվանումների ցանկից</tr>
<tr><td><img class="textimg" src="img/cancel.png" /><td>Հեռացնել նշված տողը</td></tr>
<tr><td><img class="textimg" src="img/edit.png" /></td><td>Խմբագրել նշված տողում ապրանքի տվյալները</tr>
<tr><td><img class="textimg" src="img/new.png" /><td>Ավելացնել նոր տող և գրանցել նոր ապրանքի անվանում</td></tr>
<tr><td>Պատասխանատու անձիք էջ</td><td></td></tr>
<tr><td>Մատակարար</td><td>Պահեստի մուտքի դեպքում ապրանքի մատակարարը</td></tr>
<tr><td>Հանձնեղ</td><td>Փասթաթուղթը կազմող մարդու անունը</td></tr>
<tr><td>Ընդունեց</td><td>Փասթաթուղթը և ապրանքը ընդունող մարդու անունը</td></tr>
<tr><td>Վճարում էջ</td><td></td></tr>
<tr><td>Վճառման ամսաթիվ</td><td>Ամսաթիվ, որին ստեղծվելու է դրամարկղի ելքի փասթաթուղթ։</td></tr>
<tr><td>Վճառված է</td><td>Եթե նշված է, դրամարկղում ստեղծվելու է դրամի ելքի փասթաթուղթ։</td></tr>
<tr><td>Վճարում</td><td>Վճառման եղանակ․ Կարող է լինել կանխիկ, բանկի փոխանցում կամ քարտ։</td></tr>
<tr><td>Ելքի դրամարկղ</td><td>Դրամարկղի կոդ, որից դուրս է գրվելու գումարը։</td></tr>
<tr><td>Լրացուցիչ ծախսեր էջ</td><td>Կոմպլեկտավորման ժամանակ լրացուցիչ ծախսերի գրանցում։ Նոր ապրանքի ինքնառժեքը ավելանալու է։</td></tr>
</table>
</p>
<p class="header">Պահեստի մուտք</p>
<p class="history">Պահեստի մուտքի ժամանակ անհրաժեշտ է պարտադիր նշել մուտքի ամսաթիվը, մուտքի պահեստը, նշանակությունը և լրացնել ապրանքների ցանկը։ Փասթաթուղթը ավտոմատ ստաքնալու է հերթական համարը, բայց հնարավոր է նաև նշել այլ։ ՀԱ /հաշիվ ապրանքագիր/ ամսաթիվը և ՀԱ համարը կարելի է բաց թողնել։ Ապրանքները ավելացնելու ժամանակ անհրաժեշտ է նշել քանակը և գինը, իսկ ընդհանուր գումարը հաշվարկվելու է ավտովատ։ Կարելի է նաև նշել ընդհանուն գումարը, այս դեպքում ավտոմատ հաշվարկվելու է գինը։ Ապրանքների ցանկը էջից հետո գտնվում է "Պատասխանատու անձիք" էջը, որտեղ հնարավոր է նշել մատակարարին, ապրանքը ընդունող և ապրանքը հանձնող մարդկանց աննուները։ Մյուս էջը - "Վճարում"։ Այստեղ հնարավոր է նշել, թե երբ է կատարվել վճարումը։ Վճարումը նշելուց հետո համապատասխան դրամարկղից գումար է դուրս գրվելու և ստեղծվելու է համապատասխան դրամարկղի ելքի փասթաթուղթ։ Դրամարկղի ելքի փասթաթուղթը ստեղծվելու է անգամ այն դեպքում, եթե մուտքի փասթաթուղթը սևագիր է, և դրամարկղի փասթաթուղթը նաև գտնվում է սևագիր վիճակում։</p>
<p class="header">Պահեստի Ելք</p>
<p class="history">Պահեստի մուտքի ժամանակ անհրաժեշտ է պարտադիր նշել ելքի ամսաթիվը, ելքի պահեստը, նշանակությունը և լրացնել ապրանքների ցանկը։ Ապրանքների գինը պետք չի նշել, քանի որ դա հաշվարկվելու է ավտովատ։ Պետք է նշել, որ պահեստում ապրանքի բացակայության դեպքում հնարավոր չի լինելու գրանցել փասթաթուղթը։</p>
<p class="header">Պահեստի տեղաշարժ</p>
<p class="history">Պահեստի մուտքի ժամանակ անհրաժեշտ է պարտադիր նշել փասթաթղթի ամսաթիվը, ելքի պահեստը, մուտքի պահեստը, նշանակությունը և լրացնել ապրանքների ցանկը։ Ապրանքների գինը պետք չի նշել, քանի որ դա հաշվարկվելու է ավտովատ։ Պետք է նշել, որ պահեստում ապրանքի բացակայության դեպքում հնարավոր չի լինելու գրանցել փասթաթուղթը։</p>
<p class="header">Պահեստի կոմպլեկտավորում</p>
<p class="history">Կոմպլեկտավորումը թույլ է տալիս մի շարք ապրանքներ պահեստում դուրս գրել, կոմպլեկտավորել և նորից մուտքագրել պահեստ այլ անվանումի տակ։ Օրինակ՝ դուրս է գրվում ավազ, ցեմենտ և մուտքագրվում է բլոկ։ Ընդ վորում նոր ստացած ապրանքի գինը լինելու է ելքագրված ապրանքների հանրագումարը, ինչպես նաև գնի մեչ կարելի է նեռարել այլ ծախսեր, օրինակ, աշխատողի վարձը, որը լրացվում է "Լրացուցիչ ծախսեր" էջում։</p>
<p class="header">Պահեստի գույքագրում</p>
<p class="history">Գույքագրման նպատակն է ֆիքսել ապրանքների փաստացի քանակը պահեստում կոնկրետ ամսաթվի վրա։ Այդ ինֆորմացիան հետագայում օգտագործվում է պահեստի ապրանքների քանակը համապատասխանացնել իրականության հետ։ Ավելի մանրամասն այդ մասին կարդացեք Հաշվետվություններ Ապրանքի ելք մասում։</p>
<br>
<p class="header">Հաշվետվություններ</p>
<p class="history">Բոլոր հաշվետվությունները իրենից ներկայացնում են աղյուսակներ։ Տվյալները բեռնելու համար հաճախ անհրաժեշտ է նշել ժամանակաշրջանը, ինչպես նաև այլ պարամետրերը, որոնք հադիսանում են ֆիլտր տվյալների համար։ Բոլոր աղյուակներում սյունի անվան վրա կարելի է կտացնել մկնիկի աջ կոճակով և կիռարել արագ ֆիլտր, ինչպես Excel-ում։ Այլ ուրիշ արագ փնտրելու ձև աղյուսակում հանդիսանում է միաժամանակ Ctrl + F կոճակների կոմբինացիան, որը աղյուսակի վերևի մասում բացում է հատուկ դաշտ, որտեղ կարելի գրել բառ, կամ բառի մի մասը և ըստ դրա աղյուսակում մնալու են բոլոր այն տողերը, որոնք պարունակում են գրվածը։ Փնտրելու պարամետրերի պատուհանը բապկացած է երկու էջից։ Առաջին էջում նշվում են այն պայմանները, ըստ որի բեռնվելու են տվյալները, իսկ երկրորդ էջում կարելի է նշել այն հաշվետվության սյուները, որոնք պետք է ներարած լինեն հաշվետվության մեջ։ Ցուցադրելով, կամ թաքցնելով հաշվետվության սյուները ֆիլտրի միջոցով կարելի է ստանալ տարբեր ձևերի հաշվետվություններ։Եթե հաշվետվությունը պարունակում է "Համար" սյունը, ապա երկու անգամ կտացնելով մկնիկի ձախ կոճակով տողի վրա բացվում է համապատասպան փասթաթուղթը, որը կարելի է, օրինակ, խմբագրել։</p>
<p class="header">Փասթաթղթերի մատյան</p>
<p class="history">Այստեղ գտնվում են բոլոր գրանցումները, այսնքն պահեստի մուտքի, ելքի, տեղաշարժի, դրամարկղի փասթաթղթերը և այլն։ Վերևի գործիքները հնարավորություն են տալիս հաշվետվության մեջ նշված տողերի փասթաթղթերը գրանցել, դարձնել սևագր, հեռացնել։ Պետք է նշել, որ որոշ փասթաթղթերը կապված են այլ ուրիշ փասթաղթերի հետ և անմիջապես խմբագրման ենթակա չէն։</p>
<p class="header">Պահեստի փասթաթղթեր</p>
<p class="history">Այստեղ գտնում են միայն պահեստի մուտքերի, ելքերի, տեղաշարժի, կոմպլեկտավորման փասթաթղթերը։</p>
<p class="header">Ապրանքներ պահեստում</p>
<p class="history">Ապրանքներ պահեստում աշխատում է երկու տարբերակով, որը կարելի ընտրել պարամետրերի մեջ դենելով նշան "Ցուցադրել սևագրերը" դաշտում։ Եթե այդ նշանը դրված չէ, ապա պահեստում ցուցադրված ապրանքների քանակները կազմված են միայն գրանցված փասթաթղթերից։ Եթե նշանը դրված է, ապա ապրանքների քանակը կազմված է նաև սևագրեր փասթաթղթերից։</p>
<p class="header">Տեղաշարժ պահեստում</p>
<p class="history">Այս հաշվետվությունը արտացոլում է պահեստ մուտք և ելք եղաց ապրանքները, տող առ տող։ Հաճախ օգտագործվում է պահեստում ապրանքի քանակի առաջացման հասկանալու համար։</p>
<p class="header">Տեղաշարժ պահեստում, ապակոմպլեկտավորված</p>
<p class="history">Այն դեպքերում, երբ ապրանքի մի մասը պահեստում գտնվում է արկղների մեջ, իսկ մյուս մասը արկղերիծ հանած է և պահեստում երևում է հատով, տվյալ ապրանքի տեղաշարժի ընհանուր քանակը հասկանալու համար օգտագործվում է այս հաշվտվությունը։ Օրինակ, ապրանքի վաճառքը հնարավոր է և բլոկով և հատով։ Պահեստում առկա է 10 բլոկ խաղալիք, , և 5 հատ խաղալիք, որը հանվել բլոկից։ Մեկ բլոկի մեջ առկա է 10 հատ խաղալիք։ Ապա այս հաշվետվությունը ցույց կտա 10 x 10 + 5 = 105 հատ խաղալիք։ Այս հաշվետվությունը կաշխատի այն ժամանակ, եթե արկղով ապրանքի քարտի մեջ նշված է կոմպլեկտավորման բաժինում, որ ինքը բաղկացած է 10 հատ այլ ապրանքի միավորից։</p>
<p class="header">Ապակոմպլեկտավորված ապրանքներ պահեստում</p>
<p class="history">Այն դեպքերում, երբ ապրանքի մի մասը պահեստում գտնվում է արկղների մեջ, իսկ մյուս մասը արկղերիծ հանած է և պահեստում երևում է հատով, տվյալ ապրանքի ընհանուր քանակը հասկանալու համար օգտագործվում է այս հաշվտվությունը։ Օրինակ, ապրանքի վաճառքը հնարավոր է և բլոկով և հատով։ Պահեստում առկա է 10 բլոկ խաղալիք, , և 5 հատ խաղալիք, որը հանվել բլոկից։ Մեկ բլոկի մեջ առկա է 10 հատ խաղալիք։ Ապա այս հաշվետվությունը ցույց կտա 10 x 10 + 5 = 105 հատ խաղալիք։ Այս հաշվետվությունը կաշխատի այն ժամանակ, եթե արկղով ապրանքի քարտի մեջ նշված է կոմպլեկտավորման բաժինում, որ ինքը բաղկացած է 10 հատ այլ ապրանքի միավորից։</p>
<p class="header">Ապրանքի ելք ըստ վաճառքի</p>
<p class="history">Այս հաշվետվությունը արտացոլում է պահեստում ապրանքի շարժը նշված ժամանակաշրջանի համար։ Ցուցադևվում է ապրանքի նախնական մնացորդը, մուտքը, ելքը, հաշվարկային մնացորդը, գույքագրման տվյալները և տարբերություն /պակասնորդ կամ ավելցուկ/։ Ընդ որում այստեղ նաև հնարավոր է կատարել պահեստում ապրանքի քանակի ուղղում։ Գուքագրման դաշտում ապրանքի տողի վրա եկու անգամ կտացնելուց հետո բացվում է դաշտ, որտեղ անմիջապես հնարավոր է մուտք անել ապրանքի փաստացի քանակը և միանգամից տեսնել տարբերությունը ծրագրի քանակի հետ։ Բոլոր ապրանքների փաստացի քանակները մուտքագրելուց հետո գործիքների "Արտահանել մուտք/ելք" կոճակը սեխմելով ստանում ենք պահեստի մուտք և պահեստի ելք փասթաթղթերը, որպեսզի մուտքագրվի ապրանքի ավելցուկը և ելքագրվի ապրանքի պակասնորդը ծրագրի և փաստացի քանակները համապատասխանացնելու նխատակով։</p>
<p class="header">Վաճառք, ընդհանուր</p>
<p class="history">Վաճարքների ըստ կտրոնների հաշվտվություն, արտացոլում է վաճառքը ըստ գործարքների։</p>
<p class="header">Վաճառք, ուտեստներ</p>
<p class="history">Ռեստորանի, սրճարանի կամ արագ սննդի կետում վաճառքի ամփոփումը ըստ ուտեստների։</p>
<p class="header">Վաճառք պահեստից</p>
<p class="history">Ռեստորանի, սրճարանի կամ արագ սննդի կետում վաճառքի ամփոփումը ըստ ուտեստի բաղադրատոմսով ելքագրված ապրանքները պահեստից։ Այս դեպքում նաև հանդիսանում է ուտեստների ինքառժեքների հաշվետվություն։ Եթե համակարգը կիռարվում է խանութի վաճառատեղի համար, ապա այս հաշվետվությունը արտացոլում է վաճառքը ըստ տեսականի։</p>
<p class="header">Դրամարկղ</p>
<p class="history">Դրամային գործարքները և հաշվետվությունները գտնվում են այս բաժնում։ Երբ վաճառքի ծրագրով կատարվում է գործարք, կարգավորումներում նշված դրամարկղում ավտոմատ գրանցվում է դրամի մուտք։ Այլ ավտոմատ գրանցում տեղի ունենում պահեստի մուտքի փասթաթուղթ ստեղծելու ժամանակ, մնացաց բոլոր դեպքերում դրամարկղում գործարքները կատարվում են մարդու կողմից։</p>
<p class="header">Նոր դրամարկղի փասթաթուղթ</p>
<p class="history"><b>Նոր դրամարկղի փասթաթուղթը</b> նախատեսված է դրամարկղում դրամի մուտք, ելք կամ տեղաշարժ գրանցելու համար։ Դրամի ելք գրանցելու համար պետք է լրացնել միայն "Ելքի դրամարկղ" դաշտը, դրամի մուտք գրանցելու համար պետք է լրացնել միայն "Մուտքի դրամարկղ" դաշտը և դրամի տեղաշարժ գրանցելու համար պետք լրացնել և "Ելքի դրամարկղ" և "Մուտքի դրամարկղ" դաշտերը։ </p>
<p><table class="minimalistBlack">
<thead>
<th>Դաշտ</th><th>Նշանակություն</th>
</thead>
<tr><td>Ամսաթիվ</td><td>Դրամի շարժի ամսաթիվը</td></tr>
<tr><td>Ելքի դրամարկող</td><td>Դրամարկղի կոդ, որից գումարը ելքագրվում է</td></tr>
<tr><td>Մուտքի դրամարկղ</td><td>Դրամարկղի կոդ, որտեղ գումարը մուտքագրվում է</td></tr>
<tr><td>Գործընկեր</td><td>Գործընկերոչ կոդ։</td></tr>
<tr><td>Մեկնաբանություն</td><td>Լրացուցիչ տեղեկություններ</td></tr>
<tr><td><img class="textimg" src="img/add.png" /></td><td>Ավելացնել նոր տող</tr>
<tr><td><img class="textimg" src="img/cancel.png" /><td>Հեռացնել ակտիվ տողը</td></tr>
</table>
</p>
<p class="header">Գործարքներ դրամարկղում</p>
<p class="history"><b>Գործարքներ դրամարկղում</b> դա հաշվետվություն է, որը ֆիլտրում նշված ժամանակաշրջանում ցույց է տալիս՝</p>
<p>1. առաջին տողում ժամանակաշրջանի սկզբում դրամի փասթացի մնացորդ</p>
<p>2. այնուհետև բոլոր դրամի մուտքերը և ելքերը, որոնք տեղի են ունեցել նշված ժամանակաշրջանում։</p>
<p>3. ժամանակաշրջանի վերջում դրամի փասթացի մնացորդ</p>
<p class="header">Դրամի շարժ</p>
<p class="history"><b>Դրամի շարժը</b> <b>Գործարքներ դրամարկղում</b>  հաշվետվության նման է, տարբերությունը դրանում է, որ սկզբնական և վերջնական մնացորդները չէն երևում։ Դրանց փախարեն արտացոլված է մուտքերի և ելքերի ընդհանուր գումարը։</p>
<p class="header">Դրամարղների ցանկ</p>
<p class="history">Այստեղ գրանցվում են դրամարղները, որոնց հետ հետագայում պետք է աշխատել։ Արնվազն մեկ դրամարկղ պետք է գրանցել կանխիկը մուտք անելու համար։ Եթե վճարումը կատարվելու է նաև քարտերի միջոցով, ապա առանձին գրանցվում է նաև անկանխիկ դրամարկղ։</p>
<p class="header">Աշխատավարձ</p>
<p class="history">Համակարգը հնարավորություն է տալիս գրանցել աշխտողների աշխատավարձը, ինչպես նաև կարող է հաշվարկել աշխատավարձը կախված վաճառքի գումարից, աշխատած ժամերից և այլն։ Այդ պայմանները առանձին քննարկվում են ծրագիրը ձերք բերման ժամանակ, քանի որ գոյություն ունեն բազմաթիվ ֆորմուլաներ։</p>
<p class="header">Նոր աշխատավարձի փասթաթուղթ</p>
<p class="history"><b>Նոր աշխատավարձի փասթաթուղթը</b> լրացնելու համար անհրաժեշտ է լրացնել հետևյալ դաշտերը</p>
<p>
<p><table class="minimalistBlack">
<thead>
<th>Դաշտ</th><th>Նշանակություն</th>
</thead>
<tr><td>Փասթաթղթի համար</td><td>Նշանակում է ծրագիրը</td></tr>
<tr><td>Ամսաթիվ</td><td>Փասթաթղթի գրանցման ամսաթիվ</td></tr>
<tr><td>Հերթ</td><td>Աշխատանքային հերթ։ կարող է լինել ցերակային, գիշերային ինչպես նաև կարելի է նշել այլ տարբերակ։</td></tr>
<tr><td>Դրամարղի փասթաթղթի համար</td><td>Վճարում կարող է կատարվել այլ օր, այդ պատճառով դրամարկղի փասթաթղթի ամսաթիվը գրանցվում է առանձին</td></tr>
<tr><td>Ելքի դրամարկղ</td><td>Դրամարկղի կոդ, որիղ կատարվում է վճարում</td></tr>
<tr><td>Մեկնաբանություն</td><td>Այլ տեղեկություններ</td></tr>
<tr><td><img class="textimg" src="img/add.png" /></td><td>Ավելացնել նոր տող աշխատողի անունով</tr>
<tr><td><img class="textimg" src="img/cancel.png" /><td>Հեռացնել ակտիվ տողը աշխատողի անունով</td></tr>
</table>
</p>
<p class="header">Ճաշացանկ</p>
<p class="history">Ճաշացանկը ունի հետևյալ կառուցվացք։ Յուրաքանչուրը ուտեստը պատկանում է տեսակին։ Ուտեստի տեսակը իր հերթին պատկանում է ինչ որ բաժնին, որը իր հերթին պատկանում է ճաշացանկին։ Օրինակ Ճաշացանկում գոյություն ունի Սպաս։ Իրա տեսեկը կարող է լինել Ապուր։ Ապուրը իր հերթին պականում է Խոհանոց բաժնին, որը հինմանակ ճաշացանկի անդամ է։ Այսպիսով, ճաշացանկը կազմելու համար անհրաժեշտ է կատարել հետեյալ քայլերը։</p>
<p>1. Գրանցել առնվազն մեկ ճաշացանկի անվանում "Ճաշացանկ / Ճաշացանկների ցանկ" բաժնում։</p>
<p>2. Գրանցել առնվազն մեկ ուտեստների տեսակների բաժնի անվանումը "Ճաշացանկ / Ուտեստների բաժիններ" բաժնում։</p>
<p>3. Գրանցել ուտեստների տեսակների անվանումները "Ճաշացանկ / Ուտեստների տեսակներ" բաժնում։</p>
<p>4. Գրանցել ուտեստների անվանումները "Ճաշացանկ / ՈՒտեստների" բաժնում։ </p>
<p>
<p><table class="minimalistBlack">
<thead>
<th>Դաշտ</th><th>Նշանակություն</th>
</thead>
<tr><td>Հիմնական էջ</td><td>Ընդհանուր ուտեստի նկարագրությունը</td></tr>
<tr><td>Համար</td><td>Ոտեստի հերթական համար։ Նշանակում է ծրագիրը</td></tr>
<tr><td>Տեսակ</td><td>Ուտեստի տեսակի կոդ։ Նշելուց հետո ավտոմատ նշանակվում է նաև բաժինը։</td></tr>
<tr><td>Անվանում</td><td>Ուտեստի լրիվ անվանումն է։</td></tr>
<tr><td>Մեկնաբանություն</td><td>Այլ տեղեկություններ</td></tr>
<tr><td>Հերթ</td><td>Վաճառքի ծրագրում ուտեստների անվանումները դասավորված են ըստ այբուբենի։ Այն դեպքում երբ այդ դասավորվածությունը պետք է փոխել, օգտագործվում է այս դաշտը, որտեղ թվի միջոցով նշվում է ուտեստի հերթը ցուցադրվող ցանկում։</td></tr>
<tr><td>Գույն</td><td>Ուտեստի վանդակի գույնը վաճառքի ցրագրում։</td></tr>
<tr><td>Ավելացնել սպասարկման տոկոս</td><td>Եթե նշված է, հնարավոր է ուտեստի գնին ավելացնել նաև սպասարկման գումար։</td></tr>
<tr><td>Հնարավոր է զեղչել</td><td>Եթե նշված է, ուտեստի գինը կարելի է նվազացնել զեղչի միջոցով</td></tr>
<tr><td>Հիշեցում</td><td>Եթե նշված է, պատվերը հաստատելուց լրացուցիչ ազդանշան է լինելու պատրաստման վայրում։</td></tr>
<tr><td>Ճաշացանկ աղյուսակ</td><td>Այս աղյուսակում նշվում է թե ինչ գնով է վաճառվելու, պահեստ և այլ։ Դրանց բացատրություն ներքևում։</td></tr>
<tr><td>Ճաշացանկ</td><td>Ճաշացանկի անվանում, որտեղ նշվելու է գինը, պահեստը, տչպիչները և այլ։</td></tr>
<tr><td>Գին</td><td>Ուտեստի գինը տվյալ ճաշացանկում։</td></tr>
<tr><td>Պահեստ</td><td>Դա այն պահեստն է, որից դուս է գրվելու ապրանքը, որը մտնում է տվյալ ուտեստի բաղադրատոմսի մեջ։</td></tr>
<tr><td>Տպիչ 1</td><td>Պատվերը հաստատելուց հետո այս տպիչից դուրս է գալու առաջին պատրաստման կտրոնը։</td></tr>
<tr><td>Տպիչ 2</td><td>Պատվերը հաստատելուց հետո այս տպիչից դուրս է երկրորդ պատրաստման կտրոնը։</td></tr>
<tr><td>X</td><td>Եթե նշված է, ապա վաճառքի ծրագրում ուտեստների ցանկում առկա է։ </td></tr>
<tr><td>Բաղադրատոմս էջ</td><td></td></tr>
<tr><td><img class="textimg" src="img/add.png" /></td><td>Ավելացնել նոր ապրանքի տող գրանցվաց ապրանքների անվանումների ցանկից</tr>
<tr><td><img class="textimg" src="img/new.png" /><td>Ավելացնել նոր ապրանքի տող և գրանցել նոր ապրանքի անվանում</td></tr>
<tr><td><img class="textimg" src="img/cancel.png" /></td><td>Հեռացնել նշված տողը</tr>
<tr><td><img class="textimg" src="img/print.png" /><td>Տպալ բաղադրատոմսը</td></tr>
<tr><td>Մեկնաբանություն էջ</td><td>Այս մեկնաբանությունները հնարավոր է ավելացնել ուտեստին պատվերի մեջ ավելացնելու ժամանակ։ Օրինակ, Սուրճի դեպքում կարելի է ավելցանել դառը, քաղցր և նորմալ տարբերակները, և երբ սուրճը ավելացվելու է պատվերի մեջ, պարտադիր կերպով բացվելու է պատուհան, որտեղից կարելի է ընտրել այդ տարբերակներից մեկը, կամ ուղղակի փակել այդ պատուհանը, առանձ ոչ մի տարբերակ ընտրելու։</td></tr>

</table>
</p>
</div>
</body> 

</html>
