<?php
?>
<html>

<head>
<meta http-equiv=Content-Type content="text/html; charset=utf-8">
<link rel="stylesheet" href="style.css" type="text/css" />
</head>

<body>
<div class="div-menu">
<ul id="content" class="ul1">
    <li>Գործողություններ
        <ul class="ul2">
            <li>Նոր պահեստի մուտք</li>
            <li>Նոր պահեստի ելք</li>
            <li>Նոր պահեստի տեղաշարժ</li>
            <li>Նոր պահեստի կոմպլեկտավորում</li>
            <li>Նոր պահեստի ապակոմպլեկտավորում</li>
            <li>Նոր պահեստի գույքագրում</li>
        </ul>
	</li>
    <li>Հաշվետվություններ
		<ul class="ul2">
			<li>Փասթաթղթերի մատյան</li>
			<li>Պահեստի փասթաթղթեր</li>
			<li>Ապրանքներ պահեստում</li>
			<li>Տեղաշարժ պահեստում</li>
			<li>Տեղաշարժ պահեստում, ապակոմպլեկտավորված</li>
			<li>Ապակոմպլեկտավորված ապրանքներ պահեստում</li>
			<li>Ապրանքի ելք ըստ վաճառքի</li>
			<li>Վաճառք, ընդհանուր</li>
			<li>Վաճառք, ուտեստներ</li>
			<li>Վաճառք, տեսականի</li>
		</ul>
	</li>
	
    <li>Դրամարկղ</li>
    <li>Աշխատավարձ</li>
    <li>Ճաշացանկ</li>
    <li>Ապրանքներ</li>
    <li>Այլ</li>
    <li>Կարգավորումներ</li>
</ul>
<br>
</div>
<div class="div-history">
<p class="header">Գործողություններ</p>
<p class="history">Բոլոր գործողությունները պահեստում միանման են։ Պետք է նշել պահեստը, հավաքել ապրանքների ցանկը։ Ապրանքների ցանկը լրացնելու համար պետք է սեղմել <img class="textimg" src="img/add.png" /> կոճակը, և ցանկից ընտրել անհրաժեշտ ապրանքը։ Եթե ցանկի մեջ անհրաժեշտ ապրանքի անվանումը բացակայում է, ապա այդ ապրանքը պետք է ավելացնել ցանկում, սեղմելով <img class="textimg" src="img/new.png" /> կոճակը։
<p class="header">Պահեստի մուտք</p>
<p class="history">Պահեստի մուտքի ժամանակ անհրաժեշտ է պարտադիր նշել մուտքի ամսաթիվը, մուտքի պահեստը, նշանակությունը և լրացնել ապրանքների ցանկը։ Փասթաթուղթը ավտոմատ ստաքնալու է հերթական համարը, բայց հնարավոր է նաև նշել այլ։ ՀԱ /հաշիվ ապրանքագիր/ ամսաթիվը և ՀԱ համարը կարելի է բաց թողնել։ Ապրանքները ավելացնելու ժամանակ անհրաժեշտ է նշել քանակը և գինը, իսկ ընդհանուր գումարը հաշվարկվելու է ավտովատ։ Կարելի է նաև նշել ընդհանուն գումարը, այս դեպքում ավտոմատ հաշվարկվելու է գինը։ Ապրանքների ցանկը էջից հետո գտնվում է "Պատասխանատու անձիք" էջը, որտեղ հնարավոր է նշել մատակարարին, ապրանքը ընդունող և ապրանքը հանձնող մարդկանց աննուները։ Մյուս էջը - "Վճարում"։ Այստեղ հնարավոր է նշել, թե երբ է կատարվել վճարումը։ Վճարումը նշելուց հետո համապատասխան դրամարկղից գումար է դուրս գրվելու և ստեղծվելու է համապատասխան դրամարկղի ելքի փասթաթուղթ։ Դրամարկղի ելքի փասթաթուղթը ստեղծվելու է անգամ այն դեպքում, եթե մուտքի փասթաթուղթը սևագիր է, և դրամարկղի փասթաթուղթը նաև գտնվում է սևագիր վիճակում։</p>
<p class="header">Պահեստի Ելք</p>
<p class="history">Պահեստի մուտքի ժամանակ անհրաժեշտ է պարտադիր նշել ելքի ամսաթիվը, ելքի պահեստը, նշանակությունը և լրացնել ապրանքների ցանկը։ Ապրանքների գինը պետք չի նշել, քանի որ դա հաշվարկվելու է ավտովատ։ Պետք է նշել, որ պահեստում ապրանքի բացակայության դեպքում հնարավոր չի լինելու գրանցել փասթաթուղթը։</p>
<p class="header">Պահեստի տեղաշարժ</p>
<p class="history">Պահեստի մուտքի ժամանակ անհրաժեշտ է պարտադիր նշել փասթաթղթի ամսաթիվը, ելքի պահեստը, մուտքի պահեստը, նշանակությունը և լրացնել ապրանքների ցանկը։ Ապրանքների գինը պետք չի նշել, քանի որ դա հաշվարկվելու է ավտովատ։ Պետք է նշել, որ պահեստում ապրանքի բացակայության դեպքում հնարավոր չի լինելու գրանցել փասթաթուղթը։</p>
<p class="header">Պահեստի կոմպլեկտավորում</p>
<p class="history">Կոմպլեկտավորումը թույլ է տալիս մի շարք ապրանքներ պահեստում դուրս գրել, կոմպլեկտավորել և նորից մուտքագրել պահեստ այլ անվանումի տակ։ Օրինակ՝ դուրս է գրվում ավազ, ցեմենտ և մուտքագրվում է բլոկ։ Ընդ վորում նոր ստացած ապրանքի գինը լինելու է ելքագրված ապրանքների հանրագումարը, ինչպես նաև գնի մեչ կարելի է նեռարել այլ ծախսեր, օրինակ, աշխատողի վարձը, որը լրացվում է "Լրացուցիչ ծախսեր" էջում։</p>
<p class="header">Պահեստի գույքագրում</p>
<p class="history">Գույքագրման նպատակն է ֆիքսել ապրանքների փաստացի քանակը պահեստում կոնկրետ ամսաթվի վրա։ Այդ ինֆորմացիան հետագայում օգտագործվում է պահեստի ապրանքների քանակը համապատասխանացնել իրականության հետ։ Ավելի մանրամասն այդ մասին կարդացեք Հաշվետվություններ Ապրանքի ելք մասում։</p>
<br>
<p class="header">Հաշվետվություններ</p>
<p class="history">Բոլոր հաշվետվությունները իրենից ներկայացնում են աղյուսակներ։ Տվյալները բեռնելու համար հաճախ անհրաժեշտ է նշել ժամանակաշրջանը, ինչպես նաև այլ պարամետրերը, որոնք հադիսանում են ֆիլտր տվյալների համար։ Բոլոր աղյուակներում սյունի անվան վրա կարելի է կտացնել մկնիկի աջ կոճակով և կիռարել արագ ֆիլտր, ինչպես Excel-ում։ Այլ ուրիշ արագ փնտրելու ձև աղյուսակում հանդիսանում է միաժամանակ Ctrl + F կոճակների կոմբինացիան, որը աղյուսակի վերևի մասում բացում է հատուկ դաշտ, որտեղ կարելի գրել բառ, կամ բառի մի մասը և ըստ դրա աղյուսակում մնալու են բոլոր այն տողերը, որոնք պարունակում են գրվածը։ Փնտրելու պարամետրերի պատուհանը բապկացած է երկու էջից։ Առաջին էջում նշվում են այն պայմանները, ըստ որի բեռնվելու են տվյալները, իսկ երկրորդ էջում կարելի է նշել այն հաշվետվության սյուները, որոնք պետք է ներարած լինեն հաշվետվության մեջ։ Ցուցադրելով, կամ թաքցնելով հաշվետվության սյուները ֆիլտրի միջոցով կարելի է ստանալ տարբեր ձևերի հաշվետվություններ։Եթե հաշվետվությունը պարունակում է "Համար" սյունը, ապա երկու անգամ կտացնելով մկնիկի ձախ կոճակով տողի վրա բացվում է համապատասպան փասթաթուղթը, որը կարելի է, օրինակ, խմբագրել։</p>
<p class="header">Փասթաթղթերի մատյան</p>
<p class="history">Այստեղ գտնվում են բոլոր գրանցումները, այսնքն պահեստի մուտքի, ելքի, տեղաշարժի, դրամարկղի փասթաթղթերը և այլն։ Վերևի գործիքները հնարավորություն են տալիս հաշվետվության մեջ նշված տողերի փասթաթղթերը գրանցել, դարձնել սևագր, հեռացնել։ Պետք է նշել, որ որոշ փասթաթղթերը կապված են այլ ուրիշ փասթաղթերի հետ և անմիջապես խմբագրման ենթակա չէն։</p>
<p class="header">Պահեստի փասթաթղթեր</p>
<p class="history">Այստեղ գտնում են միայն պահեստի մուտքերի, ելքերի, տեղաշարժի, կոմպլեկտավորման փասթաթղթերը։</p>
<p class="header">Ապրանքներ պահեստում</p>
<p class="history">Ապրանքներ պահեստում աշխատում է երկու տարբերակով, որը կարելի ընտրել պարամետրերի մեջ դենելով նշան "Ցուցադրել սևագրերը" դաշտում։ Եթե այդ նշանը դրված չէ, ապա պահեստում ցուցադրված ապրանքների քանակները կազմված են միայն գրանցված փասթաթղթերից։ Եթե նշանը դրված է, ապա ապրանքների քանակը կազմված է նաև սևագրեր փասթաթղթերից։</p>
<p class="header">Տեղաշարժ պահեստում</p>
<p class="history">Այս հաշվետվությունը արտացոլում է պահեստ մուտք և ելք եղաց ապրանքները, տող առ տող։ Հաճախ օգտագործվում է պահեստում ապրանքի քանակի առաջացման հասկանալու համար։</p>
<p class="header">Տեղաշարժ պահեստում, ապակոմպլեկտավորված</p>
<p class="history">Այն դեպքերում, երբ ապրանքի մի մասը պահեստում գտնվում է արկղների մեջ, իսկ մյուս մասը արկղերիծ հանած է և պահեստում երևում է հատով, տվյալ ապրանքի տեղաշարժի ընհանուր քանակը հասկանալու համար օգտագործվում է այս հաշվտվությունը։ Օրինակ, ապրանքի վաճառքը հնարավոր է և բլոկով և հատով։ Պահեստում առկա է 10 բլոկ խաղալիք, , և 5 հատ խաղալիք, որը հանվել բլոկից։ Մեկ բլոկի մեջ առկա է 10 հատ խաղալիք։ Ապա այս հաշվետվությունը ցույց կտա 10 x 10 + 5 = 105 հատ խաղալիք։ Այս հաշվետվությունը կաշխատի այն ժամանակ, եթե արկղով ապրանքի քարտի մեջ նշված է կոմպլեկտավորման բաժինում, որ ինքը բաղկացած է 10 հատ այլ ապրանքի միավորից։</p>
<p class="header">Ապակոմպլեկտավորված ապրանքներ պահեստում</p>
<p class="history">Այն դեպքերում, երբ ապրանքի մի մասը պահեստում գտնվում է արկղների մեջ, իսկ մյուս մասը արկղերիծ հանած է և պահեստում երևում է հատով, տվյալ ապրանքի ընհանուր քանակը հասկանալու համար օգտագործվում է այս հաշվտվությունը։ Օրինակ, ապրանքի վաճառքը հնարավոր է և բլոկով և հատով։ Պահեստում առկա է 10 բլոկ խաղալիք, , և 5 հատ խաղալիք, որը հանվել բլոկից։ Մեկ բլոկի մեջ առկա է 10 հատ խաղալիք։ Ապա այս հաշվետվությունը ցույց կտա 10 x 10 + 5 = 105 հատ խաղալիք։ Այս հաշվետվությունը կաշխատի այն ժամանակ, եթե արկղով ապրանքի քարտի մեջ նշված է կոմպլեկտավորման բաժինում, որ ինքը բաղկացած է 10 հատ այլ ապրանքի միավորից։</p>
<p class="header">Ապրանքի ելք ըստ վաճառքի</p>
<p class="history">Այս հաշվետվությունը արտացոլում է պահեստում ապրանքի շարժը նշված ժամանակաշրջանի համար։ Ցուցադևվում է ապրանքի նախնական մնացորդը, մուտքը, ելքը, հաշվարկային մնացորդը, գույքագրման տվյալները և տարբերություն /պակասնորդ կամ ավելցուկ/։ Ընդ որում այստեղ նաև հնարավոր է կատարել պահեստում ապրանքի քանակի ուղղում։ Գուքագրման դաշտում ապրանքի տողի վրա եկու անգամ կտացնելուց հետո բացվում է դաշտ, որտեղ անմիջապես հնարավոր է մուտք անել ապրանքի փաստացի քանակը և միանգամից տեսնել տարբերությունը ծրագրի քանակի հետ։ Բոլոր ապրանքների փաստացի քանակները մուտքագրելուց հետո գործիքների "Արտահանել մուտք/ելք" կոճակը սեխմելով ստանում ենք պահեստի մուտք և պահեստի ելք փասթաթղթերը, որպեսզի մուտքագրվի ապրանքի ավելցուկը և ելքագրվի ապրանքի պակասնորդը ծրագրի և փաստացի քանակները համապատասխանացնելու նխատակով։</p>
<p class="header">Վաճառք, ընդհանուր</p>
<p class="history">Վաճարքների ըստ կտրոնների հաշվտվություն, արտացոլում է վաճառքը ըստ գործարքների։</p>
<p class="header">Վաճառք, ուտեստներ</p>
<p class="history">Ռեստորանի, սրճարանի կամ արագ սննդի կետում վաճառքի ամփոփումը ըստ ուտեստների։</p>
<p class="header">Վաճառք պահեստից</p>
<p class="history">Ռեստորանի, սրճարանի կամ արագ սննդի կետում վաճառքի ամփոփումը ըստ ուտեստի բաղադրատոմսով ելքագրված ապրանքները պահեստից։ Այս դեպքում նաև հանդիսանում է ուտեստների ինքառժեքների հաշվետվություն։ Եթե համակարգը կիռարվում է խանութի վաճառատեղի համար, ապա այս հաշվետվությունը արտացոլում է վաճառքը ըստ տեսականի։</p>
</div>
</body> 

</html>
